{
  "name": "Business Education",
  "sections": [
    {
      "name": "Business",
      "youtube": "7Zv8hvVu5ws",
      "courses": [
        {
          "name": "Business Education 9",
          "code": "MADEM09--S",
          "grade": 9,
          "elective": false,
          "desc": "This basic business course introduces students to other business courses such as: Marketing, Accounting, Economics, Entrepreneurship and Business Leadership. This course is highly recommended for all students as a tool to learn about personal finances, budgeting, investments, and major purchases in the future. Students enrolled in this course will have a chance to participate in an Elgin Park Orca Pod Dragon's Den Challenge."
        },
        {
          "name": "Entrepreneurship & Marketing 10",
          "code": "MADEM10--S",
          "grade": 10,
          "elective": false,
          "youtube": "l77xK5aCoMc",
          "desc": "This business course expands on business topics they might have learned in grade 9 and introduces the following topics more in depth: Personal Finance & Budgeting, Credit, Banking, Investments & Stock Market Simulation, Corporate Social Responsibility & Business Ethics, Economics, Marketing, Entrepreneurship, International Business, and Business Leadership. Students enrolled in this course will have a chance to create Business Plans and participate in an Elgin Park Orca Pod Dragon's Den Challenge and Business Case Studies."
        },
        {
          "name": "Marketing & Promotion 11",
          "code": "MMAP-11-S",
          "grade": 11,
          "elective": false,
          "youtube": "wCTOlZR7brA",
          "desc": "This course is a practical, activity-based course providing students with opportunities of examining the nature and role of marketing in local and global contexts as well as from a consumer perspective. Students will be encouraged to learn how marketing helps businesses determine and meet customer needs (marketing research); how businesses offer, promote and deliver products (promotions and pricing), and how to develop ethical and effective ways to meet consumer needs (products), and to explore the nature of the world economy. Students who take this course will have the opportunity to create their own Business Plan."
        },
        {
          "name": "E-Commerce 12",
          "code": "MECOM12-S",
          "grade": 12,
          "elective": false,
          "youtube": "Qr4VMgfPkuQ",
          "desc": "E-Commerce 12 is designed to apply the theories of Marketing 11 and use more advanced and professional marketing strategies, applying students' learning to e-commerence."
        },
        {
          "name": "Accounting 12",
          "code": "MACC-12--S",
          "grade": 12,
          "elective": false,
          "youtube": "ffLZe3_eZpc",
          "desc": "This course provides an introduction to fundamental accounting concepts - a system to record and summarize financial events. Students will learn how to organize data using both manual and computerized methods to record, post and summarize transactions, and prepare financial statements and reports. Students learn to create balance sheets, ledgers, income statements, journaling and posting transactions. Students will also be elective to interpret financial statements and predict what changes may occur to affect the financial positions of a company. Students will learn how to do their own personal income tax return at the end of the course. No pre-requisite elective."
        },
        {
          "name": "Entrepreneurship 12",
          "code": "MENT-12-S",
          "grade": 12,
          "elective": false,
          "youtube": "ffLZe3_eZpc",
          "desc": "This course allows students to discover the meaning of entrepreneurship and identify characteristics and skills demonstrated by entrepreneurs. They will research a variety of entrepreneurs and analyze their own entrepreneurial strengths and skills through in class activities and quizzes. They will study the different forms of business entities, how to begin a business, operate a business and create a business plan. Important areas covered in the setting up and operation of a small business includes: planning, organizing, controlling, strengths & weaknesses, site location, financing, human resources, promotion and innovation. Guest speakers will be invited to speak about their businesses. Students will have a chance to create a \"Real Life Venture\" with their classmates in this course."
        }
      ]
    }
  ]
}