[
  {
    "SectionTag": "ww",
    "SectionContentBrief": ["Woodwork 9/10,11,12", "Furniture & Cabinetry 12"],
    "VideoLink": "https://www.youtube.com/embed/N8klwje-dkc",
    "courses": [
      {
        "course_name": "Woodwork 9/10",
        "grade_levels": [9, 10],
        "elective": true,
        "course_codes": ["MADW-09--S", "MWWK-10--S"],
        "description": "This course is designed to build on the knowledge gained at the junior level. The student will be exposed to a wider variety of skills, tools, operational safety and tool maintenance. The knowledge gained will be applied in the design and manufacture of projects at a higher skill and maturity level. Accuracy and emphasis on detail is important in this course and will form a valuable part of the student's development."
      },
      {
        "course_name": "Woodwork 11",
        "grade_levels": [11],
        "elective": true,
        "course_codes": ["MWWK-11-S"],
        "prerequisite": "Recommended: Tech. Ed. Woodwork 10",
        "description": "The course is designed to build on and expand the knowledge gained at the Technology Education Wood 10 level. The student will be exposed to a wider variety of skills, tools, operational safety and tool maintenance. The knowledge gained will be applied in the design and manufacture of projects at a higher skill and maturity level. Accuracy and emphasis on detail is important in this course and will form a valuable part of the student's development."
      },
      {
        "course_name": "Woodwork 12",
        "grade_levels": [12],
        "elective": true,
        "course_codes": ["MWWK-12--S"],
        "prerequisite": "Recommended: Woodwork 11",
        "description": "This course is designed to build on the knowledge gained in Carpentry and Joinery 11. The student will be exposed to a wider variety of skills, tools, operational safety and tool maintenance. The knowledge gained will be applied in the design and manufacture of projects at a higher skill and maturity level. Accuracy and emphasis on detail is important in this course and will form a valuable part of the student's development."
      },
      {
        "course_name": "Furniture & Cabinetry 12",
        "grade_levels": [12],
        "elective": true,
        "course_codes": ["MTFAC12--S"],
        "prerequisite": "Recommended: Woodwork 11 or Woodwork 12",
        "description": "This specialty course will specifically focus on the design and creation of advanced woodcraft projects. Students will be expected to challenge themselves in creating several artistic projects in the following possible areas: wood turning, intarsia, carving, and scroll work. The student's artistic creation could be a stand-alone project or an enhancement of a value-added piece of furniture or cabinet."
      }
    ]
  },
  {
    "SectionTag": "mw",
    "SectionContentBrief": ["Metalwork 9/10,11,12", "Machining & Welding 12", "Art Metal & Jewelry 12"],
    "VideoLink": "https://www.youtube.com/embed/N6vdehj2lK8",
    "courses": [
      {
        "course_name": "Metalwork 9/10",
        "grade_levels": [9, 10],
        "elective": true,
        "course_codes": ["MADM-09--S", "MTMET10--S"],
        "description": "Are you interested in welding, art metal, or building things out of metal? This course may be for you. In Metalwork 9/10 we use hand and power tools to build a number of practical and artistic projects. Project examples may include, rings, bracelets, tools, boxes, bowls, and figures. Safety in the shop area is our top priority and practiced throughout the course. At the 9/10 level students are introduced to different kinds of welding, various types of materials, and the use of a lathe and milling machine."
      },
      {
        "course_name": "Metalwork 11",
        "grade_levels": [11],
        "elective": true,
        "course_codes": ["MTMET11--S"],
        "prerequisite": "Recommended: Metalwork 10",
        "description": "This course is designed to build on the knowledge gained at the junior level. The student will be exposed to a wider variety of skills, tools, operational safety and tool maintenance. Students will do research on materials and discover the aspects of design, as it is used in practice. The knowledge gained will be applied in the design and manufacture of projects at a higher skill and maturity level. Accuracy and attention to detail is important in this course and will form a valuable part of the student's development. Students will also be exposed to career opportunities and areas of further studies will be investigated."
      },
      {
        "course_name": "Metalwork 12",
        "grade_levels": [12],
        "elective": true,
        "course_codes": ["MTMET12--S"],
        "prerequisite": "Recommended: Metalwork 11",
        "description": "This course is designed to build on the knowledge gained in Metalwork 11. The student will be exposed to a wider variety of skills, tools, operational safety and tool maintenance. Students will research and discover the aspects of design, as it is used in the technical field. The knowledge gained will be applied in the design and manufacture of projects at a higher skill and maturity level. Oxy-acetylene cutting and fusion welding, GMAW welding and arc welding will be used. Design accuracy and an emphasis on detail is important in this course and will form a valuable part of the student's development. A bigger focus on machining takes place at this level. Students will also be exposed to career opportunities and areas of further studies will be investigated."
      },
      {
        "course_name": "Machining & Welding 12",
        "grade_levels": [12],
        "elective": true,
        "course_codes": ["MTMAW12--S"],
        "prerequisite": "Recommended: Metalwork 12",
        "description": "This is an advanced course that will focus mainly on the use of welding and machining in the creation of projects. Students will have to decipher engineered drawings to aid in the creation of their projects. Multiple types of welding will be used, and students will have a good knowledge in the strength and weaknesses of each type. Using the mill and lathe to build projects will make up a large portion of the course. The ability to evaluate and inspect milled/turned surfaces, and weld quality will be practiced throughout the semester."
      },
      {
        "course_name": "Art Metal & Jewelry 12",
        "grade_levels": [12],
        "elective": true,
        "course_codes": ["MTAMJ12--S"],
        "description": "This specialty course is individualized and allows students to design and create all of their own projects. Artistic talents and practical equipment usage will be combined. Similar tools and procedures to Metalwork 12 will be used with vastly different results in project outcomes. Art Metal students will work with mostly semi-precious mediums such as copper, brass and aluminum. Possible projects: rings, chains, pendants, bowls, wall hangings and sculptures."
      }
    ]
  },
  {
    "SectionTag": "au",
    "SectionContentBrief": ["Power Technology 9", "Automotive Power Technology and Bicycles 10", "Automotive Technology 11-12", "Engine & Drive Train 12"],
    "VideoLink": "https://www.youtube.com/embed/V-MrJJXVV6M",
    "courses": [
      {
        "course_name": "Power Technology 9",
        "grade_levels": [9],
        "elective": true,
        "course_code": ["MADPT09--S"],
        "description": "Power Technology 9 provides knowledge of power and energy transmission in mechanical devices. Two- and four-cycle engines are used to demonstrate operations, maintenance, and overhauling. Projects explore energy systems like solar, wind, hydro, and more, emphasizing their impact on society, resources, and the environment."
      },
      {
        "course_name": "Automotive Power Technology and Bicycles 10",
        "grade_levels": [10],
        "elective": true,
        "course_code": ["MTPOW10--S"],
        "description": "This course extends concepts from Power Technology 9 with more hands-on projects. Students work on go-carts or mini-bikes while exploring energy systems. Key topics include operation and maintenance of two- and four-cycle engines and automotive power systems."
      },
      {
        "course_name": "Automotive Technology 11",
        "grade_levels": [11],
        "elective": true,
        "course_code": ["MTAUT11--S"],
        "prerequisite": "Recommended: Power Tech 10",
        "description": "Designed to teach vehicle maintenance skills. Topics include safety shop practices, tools, tires, brakes, engines, and basic electrical systems. Emphasis is placed on practical labs and shop work."
      },
      {
        "course_name": "Automotive Technology 12",
        "grade_levels": [12],
        "elective": true,
        "course_code": ["MTAUT12--S"],
        "prerequisite": "Recommended: Automotive Technology 11",
        "description": "Advanced course expanding on Automotive Technology 11 concepts. Students work on detailed automotive systems and gain deeper knowledge of internal vehicle operations and modern diagnostics."
      },
      {
        "course_name": "Engine & Drive Train 12",
        "grade_levels": [12],
        "elective": true,
        "course_code": ["MTEAD12--S"],
        "prerequisite": "Automotive Technology 12",
        "description": "Focuses on diagnosing, maintaining, and repairing advanced automotive systems. Topics include engine rebuilding, drivetrain mechanics, modifications, and electronics diagnostics, including CAN-bus systems."
      }
    ]
  },
  {
    "SectionTag": "rob",
    "SectionContentBrief": [
      "Electronics and Robotics 9-12"
    ],
    "VideoLink": "https://www.youtube.com/embed/2Mm7FEVzY-0",
    "courses": [
      {
        "course_name": "Electronics and Robotics 9-12",
        "grade_levels": [9, 10, 11, 12],
        "elective": true,
        "description": "This course explores electronics and robotics, including circuit components, electrical behavior, PCB production, robot behaviors, and sensor-based responses. Topics also include microcontrollers, mechanical devices, power efficiency, and robotics coding. Projects may include cyborg mask, sumo bot, hydraulic robot arm, line-following robots, VEX clawbot, soccerbot, Arduino projects, and more. Higher level courses focus on constructing and coding complex robots and electronics."
      }
    ]
  },
  {
    "SectionTag": "dr",
    "SectionContentBrief": [
      "Drafting 9/10, 11-12",
      "Mechatronics 12"
    ],
    "VideoLink": "https://www.youtube.com/embed/MTj-tWssudI",
    "courses": [
      {
        "course_name": "Drafting 9/10",
        "grade_levels": [9, 10],
        "elective": true,
        "course_codes": ["MADD-09--S", "MTDRF10--S"],
        "description": "This course introduces Mechanical Drafting and CAD Drafting (Computer Aided Design). Topics covered include Orthographic and Isometric Projections, Dimensioning, Auxiliaries, Pictorial drawings, and working drawings. Students will have access to multiple technologies."
      },
      {
        "course_name": "Drafting 11",
        "grade_levels": [11],
        "elective": true,
        "recommended_prerequisite": "Drafting 10",
        "course_codes": ["MTDRF11--S"],
        "description": "This course focuses on developing basics of graphic representation using CAD workstations and various drafting tools. Students have access to technologies like vinyl cutters, soldering irons, hot wire cutters, laser engravers, and 3D printers. The course emphasizes skill development and quality work in creating pictorials, renderings, and projections. It prepares students for careers in technologists, draftsmen, fashion design, interior design, architecture, engineering, and industrial design."
      },
      {
        "course_name": "Drafting 12",
        "grade_levels": [12],
        "elective": true,
        "recommended_prerequisite": "Drafting 11",
        "course_codes": ["MTDRF12--S"],
        "description": "This course builds on skills from previous drafting courses and focuses on creating 3D models and animations using AutoCAD, Master Cam, and Revit. It covers mechanical and architectural drawing, combining manual and computer drafting techniques. The course also includes sketching and hand drawing, focusing on drafting conventions such as lettering, dimensioning, and view projection. Through projects, students gain an appreciation for drafting in life and career options."
      },
      {
        "course_name": "Mechatronics 12",
        "grade_levels": [12],
        "elective": true,
        "recommended_prerequisite": "Drafting 12",
        "course_codes": ["MTMEC12--S"],
        "description": "This course combines mechanical engineering and electronics. Students use CAD programs to create and prototype movements powered first by hydraulics, then by electronics. The course is project-based, and students are graded on their ability to complete movement challenges. Technologies used include vinyl cutters, laser engravers, 3D printers, and hotwire cutters."
      }
    ]
  }
]
