{
  "name": "Hybrid Learning",
  "has-youtube": false,
  "sections": [
    {
      "name": "Hybrid Learning Courses",
      "id": "hybrid-courses",
      "embed-code": '<iframe loading="lazy" style="width: 100%; aspect-ratio: 16/9; border: none; padding: 0; margin: 0;" src="https://www.canva.com/design/DAGeM3C479A/ZO6m78scN2LztlngXZrJEw/view?embed" allowfullscreen="allowfullscreen" allow="fullscreen"></iframe>',
      "courses": [
        {
          "name": "Law Studies + Career Life Connections 12 Hybrid",
          "code": "PGK--12--SHY",
          "grades": [12],
          "elective": true,
          "desc": "Are you a fan of <i>Suits</i>, <i>Criminal Minds</i>, <i>How to Get Away with Murder</i>, or <i>Dateline</i>?\
          Then this course is for you! Learn about our legal system through case studies, debates, field trips and mock trials.\
          You will learn about the roots of Canada's legal system which date back thousands of years. You will also learn about the inner workings of our criminal justice system including policing, the trial process, youth justice, and sentencing/corrections.\
          There will also be an engaging exploration into the criminal mind and why people commit crime. The course lends itself to looking not only at the justice system in Canada, but also the different roles people can play within it including the different career options within the justice system.\
          We can investigate all the career options within the Justice system through guest speakers and court speaker sessions during field studies. This course meets the requirements for both Law 12 and CLC12, including the completion of the required capstone project.\
          her CLC components include: self-exploration, career and university research, post-graduation plans, volunteerism, personal branding, budgeting, health and wellness, scholarship applications, resumes and cover letters.\
          "
        },
        {
          "name": "Career Life Connections Hybrid",
          "code": "MCLC-12--S-HYBRID",
          "grades": [11, 12],
          "elective": false,
          "desc": "Career Life Connections is a Ministry Requirement for Graduation. It begins in Career Life Education 10 and culminates with a Capstone presentation. All BC secondary school students must demonstrate they have met the following requirements for:\
          <ul>\
          <li><b>Personal Development</b>: Exploring post-graduation goals and plans; understanding that developing a sense of purpose and career-life balance supports well-being.\
          <li><b>Connections to Community</b>: Lifelong learning and active citizenship foster career-life opportunities for people and communities.\
          <li><b>Career and Life</b>: Complete the required \"Capstone project\" to present significant accomplishments and pathways going forward.\
          </ul>\
          "
        },
        {
          "name": "Pre-Calculus 11 Hybrid",
          "code": "MPREC11--S-HYBRID",
          "grades": [11],
          "elective": false,
          "desc": "This pathway is designed to provide students with the mathematical understandings and critical-thinking skills identified for entry into post-secondary programs that require the study of theoretical calculus.\
          Content in this pathway was chosen to meet the needs of students interested in pursuing careers in Math, Engineering and Science. Students will study:\
          <ul>\
          <li>Real number system\
          <li>Powers with rational exponents\
          <li>Radical operations and equations\
          <li>Polynomial factoring\
          <li>Rational expressions and equations\
          <li>Quadratic functions and equations\
          <li>Linear and quadratic inequalities\
          <li>Trigonometry\
          <li>Financial literacy\
          </ul>\
          "
        },
        {
          "name": "English First Peoples 10 Literary Studies & Career Life Education Hybrid",
          "code": "PKG--10--S-EN/CLE",
          "grades": [10],
          "elective": false,
          "desc": 'This course meets the requirements for both English 10 and CLE 10. It will be taught over two blocks (paired together) in hybrid fashion. Questions? <a href="/contact#students">See your counsellor</a>'
        },
      ]
    }
  ]
}